using App3.Помошники;
using System;
using System.Linq;
using System.Numerics;
using System.Text;
using System.Text.RegularExpressions;
using UWP.Алгоритмы;
using UWP.Помошники;

namespace Tests
{
    class Program
    {
        static void Main(string[] args)
        {
            Stribog stribog = new Stribog();
            string text = @"Вот пример статьи на 1000 символов. Это достаточно маленький текст 
оптимально подходящий для карточек товаров в интернет - магазинах или для небольших информационных публикаций.
В таком тексте редко бывает более 2 - 3 абзацев и обычно один подзаголовок.Но можно и без него.
На 1000 символов рекомендовано использовать 1 - 2 ключа и одну картину.

Текст на 1000 символов – это сколько примерно слов? Статистика Word показывает, 
что «тысяча» включает в себя 150 - 200 слов средней величины.Но, если злоупотреблять предлогами, 
союзами и другими частями речи на 1 - 2 символа, то количество слов неизменно возрастает.

В копирайтерской деятельности принято считать «тысячи» с пробелами или без. 
Учет пробелов увеличивает объем текста примерно на 100 - 200 символов – именно столько раз мы разделяем слова
свободным пространством. Считать пробелы заказчики не любят, так как это «пустое место». 
Однако некоторые фирмы и биржи видят справедливым ставить стоимость за 1000 символов с пробелами, 
считая последние важным элементом качественного восприятия. Согласитесь, читать слитный текст без единого пропуска, никто не будет. 
Но большинству нужна цена за 1000 знаков без пробелов.";

            Console.WriteLine("Исходные данные:");
            byte[] message = Encoding.Unicode.GetBytes(text);
            Console.WriteLine(text);
            byte[] res = stribog.GetHashMessage(message);
            Console.WriteLine();
            Console.WriteLine("Полученный хеш:");
            Console.WriteLine(BitConverter.ToString(res));
        }
    }
}
